# ArcWallCntrMrkVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ArcWallCntrMrkVisible Property
ParameterTypeId Class See Also
---
"Center Mark Visible"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ArcWallCntrMrkVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArcWallCntrMrkVisible As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ArcWallCntrMrkVisible {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace